e-commerce-site/app/views/layouts/_cart_text.html.erb

SELECT COUNT(*) FROM "order_products" WHERE "order_products"."order_id" = $1  [["order_id", 6]]
---
<%= link_to "#{current_order.order_products.size} Items in Cart ( #{number_to_currency current_order.subtotal} )", cart_path, class: "btn btn-link" %>