e-commerce-site/app/controllers/carts_controller.rb

  def show
    @order_items = current_order.order_products
    @order = Order.new
    order_prices = []
    @order_items.each {|order| order_prices.push (order.product.price.to_i) }
---
SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = $1  [["order_id", 6]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]