e-commerce-site/app/controllers/order_products_controller.rb

  def index
    if session[:cart]
      @order_products = OrderProduct.find session[:cart]
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "order_products".* FROM "order_products" WHERE "order_products"."id" IN (16, 17, 18)

  def create
    @order_product = OrderProduct.create(order_product_params)
---
INSERT INTO "order_products" ("quantity", "product_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 1], ["product_id", 1], ["order_id", 6], ["created_at", "2015-07-14 10:46:29.210803"], ["updated_at", "2015-07-14 10:46:29.210803"]]
INSERT INTO "orders" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-07-14 12:24:35.840942"], ["updated_at", "2015-07-14 12:24:35.840942"]]

    def set_order_product
      @order_product = OrderProduct.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 2]]